#include "stdafx.h";

void celebrateHoliday(int day, int month) {
    string holidays[31][12];
    holidays[0][0] = "С Новым годом!";
    holidays[1][0] = "С Новым годом!";
    holidays[6][0] = "С Рождеством!";
    holidays[14][1] = "День памяти воинов-интернационалистов";
    holidays[22][1] = "День защитников Отечества";
    holidays[14][1] = "С Днём Конституции!";
    holidays[7][2] = "День женщин";
    holidays[1][3] = "День единения народов Беларуси и России";
    holidays[25][3] = "День чернобыльской трагедии";
    holidays[8][4] = "С Днём Победы!";
    holidays[0][4] = "С Праздником труда!";
    holidays[14][4] = "С днём семьи!";
    holidays[2][6] = "День Независимости Республики Беларусь!";
    holidays[4][5] = "День охраны окружающей среды";
    holidays[21][5] = "День всенародной памяти жертв Великой Отечественной войны и геноцида белорусского народа";
    holidays[16][8] = "День народного единства";
    holidays[0][8] = "День знаний";
    holidays[0][9] = "День пожилых людей";
    holidays[13][9] = "День матери";
    holidays[20][9] = "День отца";
    holidays[6][10] = "День Октябрьской революции";
    holidays[1][10] = "День памяти";
    holidays[29][10] = "День рождения разработчика!";
    holidays[2][11] = "День инвалидов";
    holidays[9][11] = "День прав человека";
    holidays[16][11] = "День белорусского кино";
    holidays[24][11] = "С Рождеством!";

    if (!holidays[day - 1][month - 1].empty()) {
        cout << "\n\t" << holidays[day - 1][month - 1] << endl;
    }
}